blog/27.org
#+options: html-link-use-abs-url:nil html-postamble:t
#+options: html-preamble:t html-scripts:nil html-style:t
#+options: html5-fancy:nil tex:t toc:nil num:nil
#+html_doctype: xhtml-strict
#+html_container: div
#+html_content_class: content
#+description:
#+keywords:
#+html_link_home:
#+html_link_up:
#+html_mathjax:
#+html_equation_reference_format: \eqref{%s}
#+html_head: <link rel="stylesheet" type="text/css" href="./style.css"/>
#+html_head_extra:
#+title: SICP 3.3.3 Representing Tables
#+subtitle: 2024-03-18 Mon
#+infojs_opt:
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.2.50 (<a href="https://orgmode.org">Org</a> mode 9.6.15)

* 3.3.3 Representing Tables
Authors show how to implement tables. It is not surprising that they
show how to implement tables in terms of pairs.

What is a table? Again, a table can be defined in terms of its
interface --- data abstraction!

One can ~insert!~ a value under one or more keys. One can then
~lookup~ the value using the key(s).

Authors show the implementation of one-dimensional tables --- tables
in which values are stored under one key --- and two-dimensional
tables --- tables in which values are stored under two keys.
** Exercise 3.24
*Exercise*:

#+begin_quote
In the table implementations above, the keys are tested for equality
using ~equal?~ (called by ~assoc~).  This is not always the
appropriate test.  For instance, we might have a table with numeric
keys in which we don't need an exact match to the number we're looking
up, but only a number within some tolerance of it.  Design a table
constructor ~make-table~ that takes as an argument a ~same-key?~
procedure that will be used to test "equality" of keys.  ~Make-table~
should return a ~dispatch~ procedure that can be used to access
appropriate ~lookup~ and ~insert!~ procedures for a local table.
#+end_quote

*Answer*:

#+begin_src scheme
  (define (make-table same-key?)
    (let ((local-table (list '*table*)))
      (define (assoc-mod key records)
        (cond ((null? records) false)
              ((same-key? key (caar records)) (car records))
              (else (assoc-mod key (cdr records)))))
      (define (lookup key-1 key-2)
        (let ((subtable (assoc-mod key-1 (cdr local-table))))
          (if subtable
              (let ((record (assoc-mod key-2 (cdr subtable))))
                (if record
                    (cdr record)
                    false))
              false)))
      (define (insert! key-1 key-2 value)
        (let ((subtable (assoc-mod key-1 (cdr local-table))))
          (if subtable
              (let ((record (assoc-mod key-2 (cdr subtable))))
                (if record
                    (set-cdr! record value)
                    (set-cdr! subtable
                              (cons (cons key-2 value)
                                    (cdr subtable)))))
              (set-cdr! local-table
                        (cons (list key-1
                                    (cons key-2 value))
                              (cdr local-table)))))
        'ok)
      (define (dispatch m)
        (cond ((eq? m 'lookup-proc) lookup)
              ((eq? m 'insert-proc!) insert!)
              (else (error "Unknown operation -- TABLE" m))))
      dispatch))
#+end_src

** Exercise 3.25
*Exercise*:
#+begin_quote
Generalizing one- and two-dimensional tables, show how to implement a
table in which values are stored under an arbitrary number of keys and
different values may be stored under different numbers of keys.  The
~lookup~ and ~insert!~ procedures should take as input a list of keys
used to access the table.
#+end_quote

*Answer*:
#+begin_src scheme
  (define (gp-make-table)
    (list '*table*))

  ;; try to find record
  ;;
  ;; return pair
  ;;
  ;; if cdr of return-value is nil, then record has been found, and the
  ;; car is the record
  ;;
  ;; if cdr of return-value is not nil, then record has not been found;
  ;; car is the last key found, cdr is the list of keys to be added
  (define (find-rec t keys)
    (cond ((null? keys)
           (cons t keys))
          ((not (pair? (cdr t)))
           (cons t keys))
          (else (let ((found (assoc (car keys) (cdr t))))
                  (cond (found
                         (find-rec found (cdr keys)))
                        (else (cons t keys)))))))

  (define (to-insert keys val)
    (if (= (length keys) 1)
        (cons (car keys) val)
        (list (car keys)
              (to-insert (cdr keys) val))))

  (define (lookup t keys)
    (let ((found (car (find-rec t keys)))
          (rest-of-keys (cdr (find-rec t keys))))
      (if (null? rest-of-keys)
          (cdr found)
          false)))

  (define (insert t keys val)
    (let ((found (car (find-rec t keys)))
          (rest-of-keys (cdr (find-rec t keys))))
      (cond ((null? rest-of-keys)
             (set-cdr! found val))
            ((= (length rest-of-keys) 1)
             (set-cdr! found
                       (cons
                        (cons (car rest-of-keys) val)
                        (cdr found))))
            (else
             "adding subtable"
             (set-cdr! found
                       (cons
                        (to-insert rest-of-keys val)
                        (cdr found)))))))

  (define t (gp-make-table))
  (insert t '(letters a) 97)
  t ;; => (*table* (letters (a . 97)))
  (insert t '(letters b) 98)
  t ;; => (*table* (letters (b . 98) (a . 97)))
  (insert t '(continents europe cities barcelona population)  1620343)
  t ;; => (*table* (continents (europe (cities (barcelona (population . 1620343))))) (letters (b . 98) (a . 97)))
  (lookup t '(continents europe cities barcelona population)) ;; => 1620343
  (lookup t '(letters b)) ;; => 98
#+end_src

