blog/27.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-18 Mon 22:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP 3.3.3 Representing Tables</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP 3.3.3 Representing Tables
<br />
<span class="subtitle">2024-03-18 Mon</span>
</h1>

<div id="outline-container-org8567224" class="outline-2">
<h2 id="org8567224">3.3.3 Representing Tables</h2>
<div class="outline-text-2" id="text-org8567224">
<p>
Authors show how to implement tables. It is not surprising that they
show how to implement tables in terms of pairs.
</p>

<p>
What is a table? Again, a table can be defined in terms of its
interface &#x2014; data abstraction!
</p>

<p>
One can <code>insert!</code> a value under one or more keys. One can then
<code>lookup</code> the value using the key(s).
</p>

<p>
Authors show the implementation of one-dimensional tables &#x2014; tables
in which values are stored under one key &#x2014; and two-dimensional
tables &#x2014; tables in which values are stored under two keys.
</p>
</div>
<div id="outline-container-orgad27930" class="outline-3">
<h3 id="orgad27930">Exercise 3.24</h3>
<div class="outline-text-3" id="text-orgad27930">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
In the table implementations above, the keys are tested for equality
using <code>equal?</code> (called by <code>assoc</code>).  This is not always the
appropriate test.  For instance, we might have a table with numeric
keys in which we don't need an exact match to the number we're looking
up, but only a number within some tolerance of it.  Design a table
constructor <code>make-table</code> that takes as an argument a <code>same-key?</code>
procedure that will be used to test "equality" of keys.  <code>Make-table</code>
should return a <code>dispatch</code> procedure that can be used to access
appropriate <code>lookup</code> and <code>insert!</code> procedures for a local table.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-table</span> same-key?)
  (<span style="color: #531ab6;">let</span> ((local-table (list '*table*)))
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">assoc-mod</span> key records)
      (<span style="color: #531ab6;">cond</span> ((null? records) false)
            ((same-key? key (caar records)) (car records))
            (<span style="color: #531ab6;">else</span> (assoc-mod key (cdr records)))))
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lookup</span> key-1 key-2)
      (<span style="color: #531ab6;">let</span> ((subtable (assoc-mod key-1 (cdr local-table))))
        (<span style="color: #531ab6;">if</span> subtable
            (<span style="color: #531ab6;">let</span> ((record (assoc-mod key-2 (cdr subtable))))
              (<span style="color: #531ab6;">if</span> record
                  (cdr record)
                  false))
            false)))
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">insert!</span> key-1 key-2 value)
      (<span style="color: #531ab6;">let</span> ((subtable (assoc-mod key-1 (cdr local-table))))
        (<span style="color: #531ab6;">if</span> subtable
            (<span style="color: #531ab6;">let</span> ((record (assoc-mod key-2 (cdr subtable))))
              (<span style="color: #531ab6;">if</span> record
                  (set-cdr! record value)
                  (set-cdr! subtable
                            (cons (cons key-2 value)
                                  (cdr subtable)))))
            (set-cdr! local-table
                      (cons (list key-1
                                  (cons key-2 value))
                            (cdr local-table)))))
      'ok)
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">dispatch</span> m)
      (<span style="color: #531ab6;">cond</span> ((eq? m 'lookup-proc) lookup)
            ((eq? m 'insert-proc!) insert!)
            (<span style="color: #531ab6;">else</span> (error <span style="color: #3548cf;">"Unknown operation -- TABLE"</span> m))))
    dispatch))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgae59f33" class="outline-3">
<h3 id="orgae59f33">Exercise 3.25</h3>
<div class="outline-text-3" id="text-orgae59f33">
<p>
<b>Exercise</b>:
</p>
<blockquote>
<p>
Generalizing one- and two-dimensional tables, show how to implement a
table in which values are stored under an arbitrary number of keys and
different values may be stored under different numbers of keys.  The
<code>lookup</code> and <code>insert!</code> procedures should take as input a list of keys
used to access the table.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">gp-make-table</span>)
  (list '*table*))

<span style="color: #595959;">;; </span><span style="color: #595959;">try to find record</span>
<span style="color: #595959;">;;</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">return pair</span>
<span style="color: #595959;">;;</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">if cdr of return-value is nil, then record has been found, and the</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">car is the record</span>
<span style="color: #595959;">;;</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">if cdr of return-value is not nil, then record has not been found;</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">car is the last key found, cdr is the list of keys to be added</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">find-rec</span> t keys)
  (<span style="color: #531ab6;">cond</span> ((null? keys)
         (cons t keys))
        ((not (pair? (cdr t)))
         (cons t keys))
        (<span style="color: #531ab6;">else</span> (<span style="color: #531ab6;">let</span> ((found (assoc (car keys) (cdr t))))
                (<span style="color: #531ab6;">cond</span> (found
                       (find-rec found (cdr keys)))
                      (<span style="color: #531ab6;">else</span> (cons t keys)))))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">to-insert</span> keys val)
  (<span style="color: #531ab6;">if</span> (= (length keys) 1)
      (cons (car keys) val)
      (list (car keys)
            (to-insert (cdr keys) val))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lookup</span> t keys)
  (<span style="color: #531ab6;">let</span> ((found (car (find-rec t keys)))
        (rest-of-keys (cdr (find-rec t keys))))
    (<span style="color: #531ab6;">if</span> (null? rest-of-keys)
        (cdr found)
        false)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">insert</span> t keys val)
  (<span style="color: #531ab6;">let</span> ((found (car (find-rec t keys)))
        (rest-of-keys (cdr (find-rec t keys))))
    (<span style="color: #531ab6;">cond</span> ((null? rest-of-keys)
           (set-cdr! found val))
          ((= (length rest-of-keys) 1)
           (set-cdr! found
                     (cons
                      (cons (car rest-of-keys) val)
                      (cdr found))))
          (<span style="color: #531ab6;">else</span>
           <span style="color: #3548cf;">"adding subtable"</span>
           (set-cdr! found
                     (cons
                      (to-insert rest-of-keys val)
                      (cdr found)))))))

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">t</span> (gp-make-table))
(insert t '(letters a) 97)
t <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; (*table* (letters (a . 97)))</span>
(insert t '(letters b) 98)
t <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; (*table* (letters (b . 98) (a . 97)))</span>
(insert t '(continents europe cities barcelona population)  1620343)
t <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; (*table* (continents (europe (cities (barcelona (population . 1620343))))) (letters (b . 98) (a . 97)))</span>
(lookup t '(continents europe cities barcelona population)) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; 1620343</span>
(lookup t '(letters b)) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; 98</span>
</pre>
</div>
</div>
</div>
