blog/27.org
** Exercise 3.26
*Exercise*:

#+begin_quote
To search a table as implemented above, one needs to scan through the
list of records.  This is basically the unordered list representation
of 2-3-3.  For large tables, it may be more efficient to structure the
table in a different manner.  Describe a table implementation where
the (key, value) records are organized using a binary tree, assuming
that keys can be ordered in some way (e.g., numerically or
alphabetically).  (Compare Exercise 2-66 of Chapter 2.)
#+end_quote

Exercise 2.66 asked for a set of records structured as a binary
tree. In terms of its interface, the solution I've given already
satisfies the requirements for a one dimensional table. You feed a key
to the lookup function, you get the record, if any.

In order to make a multi-dimensional table, we could simply allow the
values of the tree (table) to be trees (subtables) themselves.

For example, here is a tree I've used in responding exercise 2.66:

#+begin_src scheme
(list->tree '( (1 "el with key 1") (2 "el with key 2") (3 "etc") (4 "foo") (6 "bar") (7 "baz")))
#+end_src

That tree has this structure[fn::To draw the structure I'm using [[https://github.com/pietroiusti/draw-tree][draw-tree]]]:

#+begin_src
"
[o|o]---[o|o]---[o|o]---[o|o]---[o|o]---[o|/]
 |       |       |       |       |       |
 |       |       |       |       |      [o|o]---[o|/]
 |       |       |       |       |       |       |
 |       |       |       |       |       7      "baz"
 |       |       |       |       |
 |       |       |       |      [o|o]---[o|/]
 |       |       |       |       |       |
 |       |       |       |       6      "bar"
 |       |       |       |
 |       |       |      [o|o]---[o|/]
 |       |       |       |       |
 |       |       |       4      "foo"
 |       |       |
 |       |      [o|o]---[o|/]
 |       |       |       |
 |       |       3      "etc"
 |       |
 |      [o|o]---[o|/]
 |       |       |
 |       2      "el wit..."
 |
[o|o]---[o|/]
 |       |
 1      "el wit..."
"
#+end_src

Given the function ~lookup~, that tree can be used as a one
dimensional table:

#+begin_src scheme
  (define (lookup given-key set)
    (cond ((null? set) false)
          ((= given-key (key (entry set)))
           (cadr (entry set)))
          ((< given-key (key (entry set)))
           (lookup given-key (left-branch set)))
          (else (lookup given-key (right-branch set)))))

  (lookup 1 (tree)) ;; => "table el 1"
#+end_src

If we add an entries whose value is a tree itself, then we can see
that we can use this structure as a multi-dimensional table.  Here,
for example, I build a tree with a key 999 whose value is a tree
itself.  Then I retrieve the value under the keys 1 and 999:

#+begin_src scheme
  (define tree (list->tree '( (1 "table el 1") (2 "table el 2") (3 "table el 3")
                              (4 "table el 4") (6 "table el 6") (7 "table el 7")
                              (999 ((1 "subtable el 1") () ((2 "subtable el 2") () ()))))))

  ;; structure of the tree:
  ;; [o|o]---[o|o]---[o|/]
  ;;  |       |       |
  ;;  |       |      [o|o]---[o|o]---[o|/]
  ;;  |       |       |       |       |
  ;;  |       |       |       |      [o|o]---[o|o]---[o|/]
  ;;  |       |       |       |       |       |       |
  ;;  |       |       |       |       |       ()      ()
  ;;  |       |       |       |       |
  ;;  |       |       |       |      [o|o]---[o|/]
  ;;  |       |       |       |       |       |
  ;;  |       |       |       |      999     [o|o]---[o|o]---[o|/]
  ;;  |       |       |       |               |       |       |
  ;;  |       |       |       |               |       ()     [o|o]---[o|o]---[o|/]
  ;;  |       |       |       |               |               |       |       |
  ;;  |       |       |       |               |               |       ()      ()
  ;;  |       |       |       |               |               |
  ;;  |       |       |       |               |              [o|o]---[o|/]
  ;;  |       |       |       |               |               |       |
  ;;  |       |       |       |               |               2      "subta..."
  ;;  |       |       |       |               |
  ;;  |       |       |       |              [o|o]---[o|/]
  ;;  |       |       |       |               |       |
  ;;  |       |       |       |               1      "subtab..."
  ;;  |       |       |       |
  ;;  |       |       |      [o|o]---[o|o]---[o|/]
  ;;  |       |       |       |       |       |
  ;;  |       |       |       |       ()      ()
  ;;  |       |       |       |
  ;;  |       |       |      [o|o]---[o|/]
  ;;  |       |       |       |       |
  ;;  |       |       |       6      "table..."
  ;;  |       |       |
  ;;  |       |      [o|o]---[o|/]
  ;;  |       |       |       |
  ;;  |       |       7      "table..."
  ;;  |       |
  ;;  |      [o|o]---[o|o]---[o|/]
  ;;  |       |       |       |
  ;;  |       |       |      [o|o]---[o|o]---[o|/]
  ;;  |       |       |       |       |       |
  ;;  |       |       |       |       ()      ()
  ;;  |       |       |       |
  ;;  |       |       |      [o|o]---[o|/]
  ;;  |       |       |       |       |
  ;;  |       |       |       3      "table..."
  ;;  |       |       |
  ;;  |       |      [o|o]---[o|o]---[o|/]
  ;;  |       |       |       |       |
  ;;  |       |       |       ()      ()
  ;;  |       |       |
  ;;  |       |      [o|o]---[o|/]
  ;;  |       |       |       |
  ;;  |       |       1      "table..."
  ;;  |       |
  ;;  |      [o|o]---[o|/]
  ;;  |       |       |
  ;;  |       2      "table..."
  ;;  |
  ;; [o|o]---[o|/]
  ;;  |       |
  ;;  4      "table..."

  (lookup 1 tree) ;; => "table el 1"

  (lookup 999 tree) ;; => ((1 "subtable el 1") () ((2 "subtable el 2") () ()))

  (lookup 1 (lookup 999 tree)) ;; => "subtable el 1"
#+end_src

