blog/27.html

<div id="outline-container-org0c0d454" class="outline-3">
<h3 id="org0c0d454">Exercise 3.26</h3>
<div class="outline-text-3" id="text-org0c0d454">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
To search a table as implemented above, one needs to scan through the
list of records.  This is basically the unordered list representation
of 2-3-3.  For large tables, it may be more efficient to structure the
table in a different manner.  Describe a table implementation where
the (key, value) records are organized using a binary tree, assuming
that keys can be ordered in some way (e.g., numerically or
alphabetically).  (Compare Exercise 2-66 of Chapter 2.)
</p>
</blockquote>

<p>
Exercise 2.66 asked for a set of records structured as a binary
tree. In terms of its interface, the solution I've given already
satisfies the requirements for a one dimensional table. You feed a key
to the lookup function, you get the record, if any.
</p>

<p>
In order to make a multi-dimensional table, we could simply allow the
values of the tree (table) to be trees (subtables) themselves.
</p>

<p>
For example, here is a tree I've used in responding exercise 2.66:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(list-&gt;tree '( (1 <span style="color: #3548cf;">"el with key 1"</span>) (2 <span style="color: #3548cf;">"el with key 2"</span>) (3 <span style="color: #3548cf;">"etc"</span>) (4 <span style="color: #3548cf;">"foo"</span>) (6 <span style="color: #3548cf;">"bar"</span>) (7 <span style="color: #3548cf;">"baz"</span>)))
</pre>
</div>

<p>
That tree has this structure<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>:
</p>

<pre class="example">
"
[o|o]---[o|o]---[o|o]---[o|o]---[o|o]---[o|/]
 |       |       |       |       |       |
 |       |       |       |       |      [o|o]---[o|/]
 |       |       |       |       |       |       |
 |       |       |       |       |       7      "baz"
 |       |       |       |       |
 |       |       |       |      [o|o]---[o|/]
 |       |       |       |       |       |
 |       |       |       |       6      "bar"
 |       |       |       |
 |       |       |      [o|o]---[o|/]
 |       |       |       |       |
 |       |       |       4      "foo"
 |       |       |
 |       |      [o|o]---[o|/]
 |       |       |       |
 |       |       3      "etc"
 |       |
 |      [o|o]---[o|/]
 |       |       |
 |       2      "el wit..."
 |
[o|o]---[o|/]
 |       |
 1      "el wit..."
"
</pre>

<p>
Given the function <code>lookup</code>, that tree can be used as a one
dimensional table:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lookup</span> given-key set)
  (<span style="color: #531ab6;">cond</span> ((null? set) false)
        ((= given-key (key (entry set)))
         (cadr (entry set)))
        ((&lt; given-key (key (entry set)))
         (lookup given-key (left-branch set)))
        (<span style="color: #531ab6;">else</span> (lookup given-key (right-branch set)))))

(lookup 1 (tree)) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; "table el 1"</span>
</pre>
</div>

<p>
If we add an entries whose value is a tree itself, then we can see
that we can use this structure as a multi-dimensional table.  Here,
for example, I build a tree with a key 999 whose value is a tree
itself.  Then I retrieve the value under the keys 1 and 999:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">tree</span> (list-&gt;tree '( (1 <span style="color: #3548cf;">"table el 1"</span>) (2 <span style="color: #3548cf;">"table el 2"</span>) (3 <span style="color: #3548cf;">"table el 3"</span>)
                            (4 <span style="color: #3548cf;">"table el 4"</span>) (6 <span style="color: #3548cf;">"table el 6"</span>) (7 <span style="color: #3548cf;">"table el 7"</span>)
                            (999 ((1 <span style="color: #3548cf;">"subtable el 1"</span>) () ((2 <span style="color: #3548cf;">"subtable el 2"</span>) () ()))))))

<span style="color: #595959;">;; </span><span style="color: #595959;">structure of the tree:</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">[o|o]---[o|o]---[o|/]</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |      [o|o]---[o|o]---[o|/]</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |      [o|o]---[o|o]---[o|/]</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |       |       |       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |       |       ()      ()</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |      [o|o]---[o|/]</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |       |       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |      999     [o|o]---[o|o]---[o|/]</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |               |       |       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |               |       ()     [o|o]---[o|o]---[o|/]</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |               |               |       |       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |               |               |       ()      ()</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |               |               |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |               |              [o|o]---[o|/]</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |               |               |       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |               |               2      "subta..."</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |               |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |              [o|o]---[o|/]</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |               |       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |               1      "subtab..."</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |      [o|o]---[o|o]---[o|/]</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |       |       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |       ()      ()</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |      [o|o]---[o|/]</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       6      "table..."</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |      [o|o]---[o|/]</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       7      "table..."</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|      [o|o]---[o|o]---[o|/]</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |      [o|o]---[o|o]---[o|/]</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |       |       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |       ()      ()</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |      [o|o]---[o|/]</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       3      "table..."</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |      [o|o]---[o|o]---[o|/]</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       ()      ()</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |      [o|o]---[o|/]</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       1      "table..."</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|      [o|o]---[o|/]</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       2      "table..."</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">[o|o]---[o|/]</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">|       |</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">4      "table..."</span>

(lookup 1 tree) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; "table el 1"</span>

(lookup 999 tree) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; ((1 "subtable el 1") () ((2 "subtable el 2") () ()))</span>

(lookup 1 (lookup 999 tree)) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; "subtable el 1"</span>
</pre>
</div>
</div>
</div>
