blog/27.org
** Exercise 3.27

*Answer*:

This exercise was somehow particularly confusing. Looking at
https://github.com/kana/sicp/blob/master/ex-3.27.md helped a
lot. After having looked at kana's solution and (beautiful diagram) I
tried to redo it on my own until I got it.

#+begin_src
  Before evaluating (memo-fib 3).

              +------------------------------------------------------------------------------------------------------+
 global env.->| memo-fib                                                                                    memoize  |
              |   |                                                                                           |      |
              +---+-------------------------+-----------------------------------------------------------------+------+
                  |    ^                    ^                                                                 |   ^
         +---------    |                    |                                                                 |   |
         |    +--------+-------+      +---+-+-+                                                               V   |
         |    | f: o-----------+----->| o | o |                                                             +---+-+-+
         |    |                |      +-+-+---+                                                             | o | o |
         |    |                |        |                                                                   +-+-+---+
         |    |                |        |                                                                     |
         |    +--------+-------+        V                                                                     |
         |             ^              p: n                                                                    V
         |             |              b: (cond ...)                                                         p: f
         |             |                                                                                    b: (let ...)
         |             |
         |    +--------+-------+
         |    | table: {...}   |
         |    |                |
         |    |                |
         |    |                |
         |    |                |
         |    +----------------+
         |           ^
         |           |
         +------+    |
                v    |
              +---+--+-+
              | o |  | |
              +-+-+----+
                |
                |
                V
             p: x
             b: (let ...)
#+end_src

~memoize~ is bound in the global env to a pair whose cdr is a pointer
to the global env and whose car points to param ~f~ and body
~(let...)~.

~memo-fib~ is bound in the global env to the value returned by the
application of memoize to a lambda expression. That value is a lambda,
therefore a procedure object, therefore a pair.

Applying ~memoize~ entails
- 1) the creation of a frame which points to the global environment
  --- the environment the ~memoize~ pairs points to --- and in which
  ~f~ is bound to a procedure object --- corresponding to the lambda
  expression passed to ~memoize~ --- which is a pair whose cdr points
  to the global env. and whose care points to param ~n~ and body
  ~(cond ...)~.
- 2) the evaluation of the body of ~memoize~ within the
  frame/environment describe in 1).

The evaluation of the body of ~memoize~ creates a frame in which
~table~ is bound to the value return by ~make-table~, and evaluates a
lambda expression within it, which produces a pair whose cdr points to
the frame in which ~table~ is defined and whose car points to param
~x~ and body ~(let...)~.

#+begin_src
Evaluating (memo-fib 3).

              +------------------------------------------------------------------------------------------------------+
 global env.->| memo-fib                                                                                    memoize  |
              |   |                                                                                           |      |
              +---+-------------------------+-----------------------------------------------------------------+------+
                  |    ^                    ^         ^               ^             ^             ^           |   ^
         +---------    |                    |         |               |             |             |           |   |
         |    +--------+-------+      +---+-+-+       |               |             |             |           V   |
         |    | f: o-----------+----->| o | o |       |               |             |             |         +---+-+-+
         |    |                |      +-+-+---+       |               |             |             |         | o | o |
         |    |                |        |             |               |             |             |         +-+-+---+
         |    |                |        |             |               |             |             |           |
         |    +--------+-------+        V             |               |             |             |           |
         |             ^              p: n            |               |             |             |           V
         |             |              b: (cond ...)   |               |             |             |         p: f
         |             |                              |               |             |             |         b: (let ...)
         |             |                       +------+-----+ +-------+----+ +------+-----+ +-----+------+
         |    +--------+-------+               | n: 3       | | n: 2       | | n: 1       | | n: 0       |
         |    | table: {...}   |               |            | |            | |            | |            |
         |    |                |               |            | |            | |            | |            |
         |    |                |               |            | |            | |            | |            |
         |    |                |<----+         +------------+ +------------+ +------------+ +------------+
         |    |                |<--+ |
         |    +----------------+   | |
         |           ^    ^ ^ ^    | +--------------------------------------------------------------+
         |           |    | | |    +-------------------------------------------------+              |
         +------+    |    | | +---------------------------------------+              |              |
                v    |    | +--------------------------+              |              |              |
              +---+--+-+  +-------------+              |              |              |              |
              | o |  o |                |              |              |              |              |
              +-+-+----+         +------+-----+ +------+-----+ +------+-----+ +------+-----+ +------+-----+
                |                | x: 3       | | x: 2       | | x: 1       | | x: 0       | | x: 1       |
                |                |            | |            | |            | |            | |            |
                V                |            | |            | |            | |            | |            |
             p: x                |            | |            | |            | |            | |            |
             b: (let ...)        +------------+ +------------+ +------------+ +------------+ +------------+
#+end_src

~memo-fib~ computes the nth Fibonacci number in a number of steps
proportional to ~n~, because ~memo-fib~ never makes the same
computation more than once.

The scheme would not work if we had simply defined ~memo-fib~ to be
~(memoize fib)~, because, in that case, the call ~(memo-fib 3)~ would
end up calling ~(fib 3)~ which would continue in the old non-memoized
way.

#+begin_export html
<div style="text-align: center;">
<a href="./posts.html">←</a>
</div>
#+end_export
