blog/27.html

<div id="outline-container-org672576c" class="outline-3">
<h3 id="org672576c">Exercise 3.27</h3>
<div class="outline-text-3" id="text-org672576c">
<p>
<b>Answer</b>:
</p>

<p>
This exercise was somehow particularly confusing. Looking at
<a href="https://github.com/kana/sicp/blob/master/ex-3.27.md">https://github.com/kana/sicp/blob/master/ex-3.27.md</a> helped a
lot. After having looked at kana's solution and (beautiful diagram) I
tried to redo it on my own until I got it.
</p>

<pre class="example">
 Before evaluating (memo-fib 3).

             +------------------------------------------------------------------------------------------------------+
global env.-&gt;| memo-fib                                                                                    memoize  |
             |   |                                                                                           |      |
             +---+-------------------------+-----------------------------------------------------------------+------+
                 |    ^                    ^                                                                 |   ^
        +---------    |                    |                                                                 |   |
        |    +--------+-------+      +---+-+-+                                                               V   |
        |    | f: o-----------+-----&gt;| o | o |                                                             +---+-+-+
        |    |                |      +-+-+---+                                                             | o | o |
        |    |                |        |                                                                   +-+-+---+
        |    |                |        |                                                                     |
        |    +--------+-------+        V                                                                     |
        |             ^              p: n                                                                    V
        |             |              b: (cond ...)                                                         p: f
        |             |                                                                                    b: (let ...)
        |             |
        |    +--------+-------+
        |    | table: {...}   |
        |    |                |
        |    |                |
        |    |                |
        |    |                |
        |    +----------------+
        |           ^
        |           |
        +------+    |
               v    |
             +---+--+-+
             | o |  | |
             +-+-+----+
               |
               |
               V
            p: x
            b: (let ...)
</pre>

<p>
<code>memoize</code> is bound in the global env to a pair whose cdr is a pointer
to the global env and whose car points to param <code>f</code> and body
<code>(let...)</code>.
</p>

<p>
<code>memo-fib</code> is bound in the global env to the value returned by the
application of memoize to a lambda expression. That value is a lambda,
therefore a procedure object, therefore a pair.
</p>

<p>
Applying <code>memoize</code> entails
</p>
<ul class="org-ul">
<li>1) the creation of a frame which points to the global environment
&#x2014; the environment the <code>memoize</code> pairs points to &#x2014; and in which
<code>f</code> is bound to a procedure object &#x2014; corresponding to the lambda
expression passed to <code>memoize</code> &#x2014; which is a pair whose cdr points
to the global env. and whose care points to param <code>n</code> and body
<code>(cond ...)</code>.</li>
<li>2) the evaluation of the body of <code>memoize</code> within the
frame/environment describe in 1).</li>
</ul>

<p>
The evaluation of the body of <code>memoize</code> creates a frame in which
<code>table</code> is bound to the value return by <code>make-table</code>, and evaluates a
lambda expression within it, which produces a pair whose cdr points to
the frame in which <code>table</code> is defined and whose car points to param
<code>x</code> and body <code>(let...)</code>.
</p>

<pre class="example">
Evaluating (memo-fib 3).

              +------------------------------------------------------------------------------------------------------+
 global env.-&gt;| memo-fib                                                                                    memoize  |
              |   |                                                                                           |      |
              +---+-------------------------+-----------------------------------------------------------------+------+
                  |    ^                    ^         ^               ^             ^             ^           |   ^
         +---------    |                    |         |               |             |             |           |   |
         |    +--------+-------+      +---+-+-+       |               |             |             |           V   |
         |    | f: o-----------+-----&gt;| o | o |       |               |             |             |         +---+-+-+
         |    |                |      +-+-+---+       |               |             |             |         | o | o |
         |    |                |        |             |               |             |             |         +-+-+---+
         |    |                |        |             |               |             |             |           |
         |    +--------+-------+        V             |               |             |             |           |
         |             ^              p: n            |               |             |             |           V
         |             |              b: (cond ...)   |               |             |             |         p: f
         |             |                              |               |             |             |         b: (let ...)
         |             |                       +------+-----+ +-------+----+ +------+-----+ +-----+------+
         |    +--------+-------+               | n: 3       | | n: 2       | | n: 1       | | n: 0       |
         |    | table: {...}   |               |            | |            | |            | |            |
         |    |                |               |            | |            | |            | |            |
         |    |                |               |            | |            | |            | |            |
         |    |                |&lt;----+         +------------+ +------------+ +------------+ +------------+
         |    |                |&lt;--+ |
         |    +----------------+   | |
         |           ^    ^ ^ ^    | +--------------------------------------------------------------+
         |           |    | | |    +-------------------------------------------------+              |
         +------+    |    | | +---------------------------------------+              |              |
                v    |    | +--------------------------+              |              |              |
              +---+--+-+  +-------------+              |              |              |              |
              | o |  o |                |              |              |              |              |
              +-+-+----+         +------+-----+ +------+-----+ +------+-----+ +------+-----+ +------+-----+
                |                | x: 3       | | x: 2       | | x: 1       | | x: 0       | | x: 1       |
                |                |            | |            | |            | |            | |            |
                V                |            | |            | |            | |            | |            |
             p: x                |            | |            | |            | |            | |            |
             b: (let ...)        +------------+ +------------+ +------------+ +------------+ +------------+
</pre>

<p>
<code>memo-fib</code> computes the nth Fibonacci number in a number of steps
proportional to <code>n</code>, because <code>memo-fib</code> never makes the same
computation more than once.
</p>

<p>
The scheme would not work if we had simply defined <code>memo-fib</code> to be
<code>(memoize fib)</code>, because, in that case, the call <code>(memo-fib 3)</code> would
end up calling <code>(fib 3)</code> which would continue in the old non-memoized
way.
</p>

<div style="text-align: center;">
<a href="./posts.html">←</a>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">To draw the structure I'm using <a href="https://github.com/pietroiusti/draw-tree">draw-tree</a></p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p>Send me an <a href="mailto:giulio.pietroiusti@gmail.com">email</a> for comments.</p> <p>Created with <span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.2.50 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</span></p>
</div>
</body>
</html>
